deprecated_cases/single_spout_bed/fluid-openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// TODO what do we set tolerance to?
solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-8;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    nOuterCorrectors    1000; // rely on residual control to stop corrector loop

    residualControl
    {
        U
        {
            tolerance   1e-4;
            relTol      0.1;
        }
        p
        {
            tolerance   5e-3;
            relTol      0.01;
        }
    }
}

relaxationFactors
{
    fields
    {
        p               1;
        pFinal          1;
    }

    equations
    {
        U   1;
        UFinal 1;
    }
}

// ************************************************************************* //
